Documents/СписаниеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СписаниеОС</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Catalog.ОсновныеСредства</xr:Item>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияОСОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.БракВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬБракВПроизводствеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.БракВПроизводствеБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатратРегл</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОС</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬНезавершенноеПроизводствоНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводствоБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.СостоянияОС</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬЗатратыНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныСписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоБУ2</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоБУ1</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоБУ3</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеРегл</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьОСВременнаяНалоговаяРазница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредствоВременнаяНалоговаяРазница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаточнаяСтоимостьНУВременнаяНалоговаяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияНУВременнаяНалоговаяРазница</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизация</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяц</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяцБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяцНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизацииНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПревышениеСуммДооценокНадСуммамиУценокБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОС</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СписаниеОС/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мСкопирован Экспорт; // хранит признак копирования документа

// Строки, хранят реквизиты имеющие смысл только для бух. учета и упр. соответственно
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми
Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыУпрУчета Экспорт; // (Упр)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой накладной,
	// разработанной методистами
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма накладной
	//
Функция ПечатьОЗ3(ПечатьПоДаннымУпрУчета = Истина)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТекДата",        МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеОС.Дата                           КАК ДатаАкта,
	|	СписаниеОС.Номер                          КАК НомерАкта,"
	+?(ПечатьПоДаннымУпрУчета,"","
	|	ВЫРАЗИТЬ(СписаниеОС.Организация.НаименованиеПолное 
	|	                    КАК СТРОКА(1000))     КАК Организация,
	|	КодыОрганизации.КодПоЕДРПОУ               КАК ЕДРПОУ,") + "
	|	СписаниеОС.ПричинаСписания                КАК ПричинаСписания,
	|	СписаниеОС.ПричинаСписания.Код            КАК КодПричины
	|ИЗ
	|	Документ.СписаниеОС                       КАК СписаниеОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&ТекДата,
	|		                                 Организация = &ТекОрганизация) КАК КодыОрганизации
	|		ПО СписаниеОС.Организация = КодыОрганизации.Организация
	|
	|ГДЕ
	|	СписаниеОС.Ссылка = &Ссылка";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();
	
	СписокОС = ОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",   Ссылка);
	Запрос.УстановитьПараметр("СписокОС", СписокОС);
	Запрос.УстановитьПараметр("ТекДата", МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	Запрос.УстановитьПараметр("СостояниеВвода", Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Если Не ПечатьПоДаннымУпрУчета Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ПервоначальныеСведенияБУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
		|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчета КАК СчетКт,
		|	СписаниеОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	СписаниеОСОС.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
		|	СписаниеОСОС.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
		|	СписаниеОСОС.ОсновноеСредство.Код КАК КодАналитикиКт,
		|	СписаниеОСОС.Ссылка.СчетСписанияБУ КАК СчетДт,
		|	СписаниеОСОС.СтоимостьБУ - СписаниеОСОС.АмортизацияБУ - СписаниеОСОС.АмортизацияЗаМесяцБУ КАК ОстаточнаяСтоимость,
		|	СписаниеОСОС.АмортизацияБУ + СписаниеОСОС.АмортизацияЗаМесяцБУ КАК Амортизация,
		|	МестонахождениеОС.Местонахождение КАК СдалоПодразделение,
		|	СостояниеОС.ДатаСостояния КАК ДатаВвода
		|ИЗ
		|	Документ.СписаниеОС.ОС КАК СписаниеОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних( 
		|		&ТекДата,
		|		ОсновноеСредство В (&СписокОС)
		|		    И Организация = &ТекОрганизация) КАК ПервоначальныеСведенияБУ
		|		ПО СписаниеОСОС.ОсновноеСредство = ПервоначальныеСведенияБУ.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|		&ТекДата,
		|		ОсновноеСредство В (&СписокОС)
		|		    И Организация = &ТекОрганизация) КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
		|		ПО СписаниеОСОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
		|		&ТекДата,
		|		Организация = &ТекОрганизация
		|		    И ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
		|		ПО СписаниеОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
		|			СостоянияОС.ДатаСостояния КАК ДатаСостояния
		|		ИЗ
		|			РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
		|		ГДЕ
		|			СостоянияОС.Состояние = &СостояниеВвода
		|			И СостоянияОС.Организация = &ТекОрганизация
		|			И СостоянияОС.ОсновноеСредство В(&СписокОС)) КАК СостояниеОС
		|		ПО СписаниеОСОС.ОсновноеСредство = СостояниеОС.ОсновноеСредство
		|ГДЕ
		|	СписаниеОСОС.Ссылка = &Ссылка";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведения.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
		|	СписаниеОСОС.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
		|	СписаниеОСОС.ОсновноеСредство.ЗаводскойНомер КАК ЗаводскойНомер,
		|	СписаниеОСОС.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
		|	СписаниеОСОС.Стоимость - СписаниеОСОС.Амортизация - СписаниеОСОС.АмортизацияЗаМесяц КАК ОстаточнаяСтоимость,
		|	СписаниеОСОС.Амортизация + СписаниеОСОС.АмортизацияЗаМесяц КАК Амортизация,
		|	МестонахождениеОС.Местонахождение КАК СдалоПодразделение,
		|	СостояниеОС.ДатаСостояния КАК ДатаВвода
		|ИЗ
		|	Документ.СписаниеОС.ОС КАК СписаниеОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ТекДата, ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведения
		|		ПО СписаниеОСОС.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ТекДата, ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
		|		ПО СписаниеОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
		|			СостоянияОС.ДатаСостояния КАК ДатаСостояния
		|		ИЗ
		|			РегистрСведений.СостоянияОС КАК СостоянияОС
		|		ГДЕ
		|			СостоянияОС.Состояние = &СостояниеВвода
		|			И СостоянияОС.ОсновноеСредство В (&СписокОС)) КАК СостояниеОС
		|		ПО СписаниеОСОС.ОсновноеСредство = СостояниеОС.ОсновноеСредство
		|ГДЕ
		|	СписаниеОСОС.Ссылка = &Ссылка";
		
	КонецЕсли;
	
	ВыборкаПоОС = Запрос.Выполнить().Выбрать();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеОС_ОЗ3";
	Макет     = ПолучитьМакет("ОЗ3");
	НеНачало  = Ложь;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
	Пока ВыборкаПоОС.Следующий() Цикл
		
		Если НеНачало Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ3");
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
		Если не ПечатьПоДаннымУпрУчета Тогда
			ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоОС);
		ОбластьМакета.Параметры.ВидОперации = "Списання";
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоКомиссии);
		ТабДокумент.Вывести(ОбластьМакета);
		НеНачало = Истина;
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСписаниеТоваров()
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		
		Возврат;
		
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ3упр" Тогда

		ТабДокумент = ПечатьОЗ3()
		
	ИначеЕсли ИмяМакета = "ОЗ3бух" Тогда
		
		ТабДокумент = ПечатьОЗ3(Ложь)
		
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
	
	КонецЕсли;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()));

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;

	Если  ОтражатьВУправленческомУчете тогда 
		СтруктураМакетов.Вставить("ОЗ3упр","Форма ОЗ-3 (упр. учет)");
	КонецЕсли;
	Если  ОтражатьВБухгалтерскомУчете тогда 
		СтруктураМакетов.Вставить("ОЗ3бух","Форма ОЗ-3 (бух. учет)");
	КонецЕсли;

	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


#КонецЕсли

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр();
	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для управленческого учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

	мСтрокаРеквизитыУпрУчета = "Событие, 
	                            |ОС.Стоимость, 
								|ОС.Амортизация, 
								|ОС.АмортизацияЗаМесяц, 
								|ОС.ОстСтоимость";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаУпр()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета = "СобытиеРегл, 
								|СчетСписанияБУ, 
								|СубконтоБУ1,
								|СубконтоБУ2,
								|СубконтоБУ3,
								|ОС.СтоимостьБУ,
								|ОС.АмортизацияБУ,
								|ОС.АмортизацияЗаМесяцБУ,
								|ОС.ОстСтоимостьБУ";
	мСтрокаРеквизитыНалУчета = "";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)

	ПодготовитьПараметрыУчетнойПолитикиУпр(СтруктураШапкиДокумента, Отказ, Заголовок);
	ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок);
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Процедура определяет параметры упр. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиУпр(СтруктураШапкиДокумента, Отказ, Заголовок)

	Если ОтражатьВУправленческомУчете Тогда
		
	КонецЕсли;

КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиУпр()

// Процедура определяет параметры регл. учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитикиРегл(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		// Прежде всего, проверим заполнение реквизита Организация в шапке документа
		СтруктураОбязательныхПолей = Новый Структура("Организация");
		// Теперь позовем общую процедуру проверки
		ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
        // Организация не заполнена, получать учетную политику нет смысла
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
 	
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		мУчетнаяПолитикаРегл = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиРегл(КонецМесяца(Дата), Организация);
		
		Если НЕ ЗначениеЗаполнено(мУчетнаяПолитикаРегл) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаРегл.ЕстьНалогНаПрибыль);
			СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015" , мУчетнаяПолитикаРегл.ЕстьНалогНаПрибыльДо2015);
			СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаРегл.ЕстьНДС);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитикиРегл()

///////////////////////////////////////////////////////////////////////////////
// ДВИЖЕНИЯ ПО РЕГИСТРАМ

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок);

	ФормированиеДвиженияОСВременнаяНалоговаяРазница(СтруктураШапкиДокумента, Отказ, Заголовок)
	
КонецПроцедуры // ДвиженияПоРегистрам

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		Возврат;
		
	КонецЕсли;

	ДатаДока = Дата;

	АмортизацияОС              = Движения.СтоимостьОС;
	ТаблицаДвиженийАмортизация = АмортизацияОС.Выгрузить();
	ТаблицаДвиженийАмортизация.Очистить();

	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
	ТабАмортизации.Колонки.Добавить("ОбъектУчета",            Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("Амортизация",            Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
	ТабАмортизации.Колонки.Добавить("Местонахождение", 	  	  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));

	Для каждого СтрокаОС из ТаблицаПоОС Цикл

		Если СтрокаОС.АмортизацияЗаМесяц > 0 Тогда

			ТекНаправление 		= Неопределено;
			ТекМестонахождение 	= Неопределено;
			Если ТаблицаПараметрыОС <> Неопределено Тогда
				
				//Затраты списываются по способу отражения расходов по амортзации
				ТекПараметрыОС = ТаблицаПараметрыОС.Найти(СтрокаОС.ОсновноеСредство,"ОС_УУ");
				ТекМестонахождение 	= ?(ТекПараметрыОС = Неопределено, Неопределено, ТекПараметрыОС.Местонахождение_УУ);
				ТекНаправление 		= ?(ТекПараметрыОС = Неопределено, Неопределено, ТекПараметрыОС.Направление_УУ);
				                                          
			КонецЕсли;
			
			НоваяСтрока    = ТабАмортизации.Добавить();

			НоваяСтрока.Амортизация            	= СтрокаОС.АмортизацияЗаМесяц;
			НоваяСтрока.ОбъектУчета            	= СтрокаОС.ОсновноеСредство;
			НоваяСтрока.НаправлениеАмортизации 	= ТекНаправление;
			НоваяСтрока.Местонахождение 		= ТекМестонахождение;

			// Движения по регистру СтоимостьОС
			Движение = ТаблицаДвиженийАмортизация.Добавить();

			Движение.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
			Движение.Амортизация      = СтрокаОС.АмортизацияЗаМесяц;
			Движение.Стоимость        = 0;

		КонецЕсли;

	КонецЦикла;

	// вызов процедуры списания амортизации по направлениям
	УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямУпр(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента);

	АмортизацияОС.мПериод          = ДатаДока;
	АмортизацияОС.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
	Движения.СтоимостьОС.ВыполнитьПриход();

	
	СостояниеОС             = Движения.СостоянияОС;
	СобытиеОС               = Движения.СобытияОС;
	АмортизацияОС           = Движения.СтоимостьОС;
	НачислениеАмортизацииОС = Движения.НачислениеАмортизацииОС;
	НазваниеДокумента       = Метаданные().Представление();

	ТаблицаДвиженийАмортизация = АмортизацияОС.Выгрузить();
	ТаблицаДвиженийАмортизация.Очистить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

		ТекОС = СтрокаТЧ.ОсновноеСредство;

		// Движения по регистру НачислениеАмортизацииОС
		Движение = НачислениеАмортизацииОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.НачислятьАмортизацию = Ложь;
		Движение.НачислятьАмортизациюВТекущемМесяце = Ложь;
		
		// Движения по регистру СобытияОС
		Движение = СобытиеОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Событие              = СтруктураШапкиДокумента.Событие;
		Движение.НазваниеДокумента = НазваниеДокумента;
		Движение.НомерДокумента    = Номер;
		
		
		// Движения по регистру СостоянияОС
		Движение = СостояниеОС.Добавить();
		Движение.Период               = ДатаДока;
		Движение.ОсновноеСредство     = ТекОС;
		Движение.Состояние            = Перечисления.СостоянияОС.СнятоСУчета;
		Движение.ДатаСостояния        = ДатаДока;
		
		// Движения по регистру СтоимостьОС
		Движение = ТаблицаДвиженийАмортизация.Добавить();
		Движение.ОсновноеСредство = ТекОС;
		Движение.Амортизация      = СтрокаТЧ.Амортизация+СтрокаТЧ.АмортизацияЗаМесяц;
		Движение.Стоимость        = СтрокаТЧ.Стоимость;

	
	КонецЦикла;

	АмортизацияОС.мПериод          = ДатаДока;
	АмортизацияОС.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
	Движения.СтоимостьОС.ВыполнитьРасход();


КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок)
	
	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		
		Возврат;
		
	КонецЕсли;

	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;
	
	//Получение данных о видах налоговой деятельности, к которым принадлежат ОС
	УправлениеВнеоборотнымиАктивами.ДополнитьТабличнуюЧастьСведениямиОбОСБухНалогРегл(МоментВремени(), ТекОрганизация, ТаблицаПоОС, 
	                                                  СтруктураШапкиДокумента,
													  Отказ, Заголовок);
	
	Если Отказ Тогда
		
		Возврат
		
	КонецЕсли;

	//Заполнение переменных
	ВидНалоговойДеятельностиНеОблагаемая = Справочники.ВидыНалоговойДеятельности.НеОблагаемая;
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда 
		// подготовим таблицу с данными по амортизации для списания амортизации по 
		// направлениям затрат

		АмортизацияОС  = Движения.СтоимостьОСБухгалтерскийУчет;

		ТаблицаДвиженийАмортизация = АмортизацияОС.Выгрузить();
		ТаблицаДвиженийАмортизация.Очистить();

		ТабАмортизации = Новый ТаблицаЗначений;
		ТабАмортизации.Колонки.Добавить("НаправлениеАмортизации", 	Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияРасходовПоАмортизации"));
		ТабАмортизации.Колонки.Добавить("ОбъектУчета",            	Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ТабАмортизации.Колонки.Добавить("Амортизация",            	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
		ТабАмортизации.Колонки.Добавить("АмортизацияНУ",			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
		ТабАмортизации.Колонки.Добавить("Местонахождение", 	  	  	Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		ТабАмортизации.Колонки.Добавить("СчетАмортизации");
		ТабАмортизации.Колонки.Добавить("НалоговоеНазначение", 		Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
		ТабАмортизации.Колонки.Добавить("ИмяСубконто", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(16)));

		Для каждого СтрокаОС из ТаблицаПоОС Цикл

			Если СтрокаОС.АмортизацияЗаМесяцБУ > 0 ИЛИ СтрокаОС.АмортизацияЗаМесяцНУ > 0 Тогда
				
				ТекМестонахождение 	= Неопределено;
				ТекНаправление 		= Неопределено;
				Если ТаблицаПараметрыОС <> Неопределено Тогда
					
					//Затраты списываются по способу отражения расходов по амортзации
					ТекПараметрыОС = ТаблицаПараметрыОС.Найти(СтрокаОС.ОсновноеСредство,"ОС_БУ");
					ТекМестонахождение 	= ?(ТекПараметрыОС = Неопределено, Неопределено, ТекПараметрыОС.Местонахождение_БУ);
					ТекНаправление 		= ?(ТекПараметрыОС = Неопределено, Неопределено, ТекПараметрыОС.Направление_БУ);
					                                          
				КонецЕсли;
				
				НоваяСтрока = ТабАмортизации.Добавить();
				НоваяСтрока.Амортизация 	= СтрокаОС.АмортизацияЗаМесяцБУ;
				НоваяСтрока.АмортизацияНУ 	= СтрокаОС.АмортизацияЗаМесяцНУ;
				НоваяСтрока.ОбъектУчета = СтрокаОС.ОсновноеСредство;
				НоваяСтрока.ИмяСубконто = "ОсновныеСредства";
				НоваяСтрока.НалоговоеНазначение 	= СтрокаОС.НалоговоеНазначение_ОС;
				
				НоваяСтрока.НаправлениеАмортизации 	= ТекНаправление;
				НоваяСтрока.Местонахождение 		= ТекМестонахождение;
				
				НоваяСтрока.СчетАмортизации        = СтрокаОС.СчетНачисленияАмортизацииБУ;
				
				// Движения по регистру СтоимостьОС
				Движение = ТаблицаДвиженийАмортизация.Добавить();
				Движение.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
				Движение.Организация      = ТекОрганизация;
				Движение.Амортизация      = СтрокаОС.АмортизацияЗаМесяцБУ;
				Движение.Стоимость        = 0;
				Движение.АмортизацияНУ    = СтрокаОС.АмортизацияЗаМесяцНУ;
				Движение.СтоимостьНУ      = 0;
				Движение.ВидОперации      = Перечисления.ВидыСобытийОС.НачислениеАмортизации;
				
			КонецЕсли;

		КонецЦикла;

		//вызов процедуры списания амортизации по направлениям
		УправлениеВнеоборотнымиАктивами.ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента, "ОС");

		АмортизацияОС.мПериод          = ДатаДока;
		АмортизацияОС.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
		Движения.СтоимостьОСБухгалтерскийУчет.ВыполнитьПриход();
		
		СобытиеОС               = Движения.СобытияОСОрганизаций;
		СостояниеОС             = Движения.СостоянияОСОрганизаций;	
		АмортизацияОС           = Движения.СтоимостьОСБухгалтерскийУчет;
		НачислениеАмортизацииОС = Движения.НачислениеАмортизацииОСБухгалтерскийУчет;
		НачислениеАмортизацииОСНУ = Движения.НачислениеАмортизацииОСНалоговыйУчет;
		ПроводкиБУ              = Движения.Хозрасчетный;
		НазваниеДокумента       = Метаданные().Представление();
		ПереоценкаОСБУ 			= Движения.ПереоценкаОСБухгалтерскийУчет;
		
		ТаблицаДвиженийАмортизация = АмортизацияОС.Выгрузить();
		ТаблицаДвиженийАмортизация.Очистить();
		
		Для каждого СтрокаТЧ Из ТаблицаПоОС Цикл

			ТекОС = СтрокаТЧ.ОсновноеСредство;
			
			// Движения по регистру НачислениеАмортизацииОСБухгалтерскийУчет
			Движение = НачислениеАмортизацииОС.Добавить();
			Движение.Период               = ДатаДока;
			Движение.ОсновноеСредство     = ТекОС;
			Движение.Организация          = ТекОрганизация;
			Движение.НачислятьАмортизацию = Ложь;
			
			Если СтрокаТЧ.ПревышениеСуммДооценокНадСуммамиУценокБУ > 0 Тогда
				
				// ПереоценкаОСБухгалтерскийУчет
				СтрокаДвижений = ПереоценкаОСБУ.ДобавитьРасход();
				
				СтрокаДвижений.Период           = Дата;
				СтрокаДвижений.ОсновноеСредство = ТекОС;
				СтрокаДвижений.Организация      = ТекОрганизация;
				
				СтрокаДвижений.СуммаПереоценки 	= СтрокаТЧ.ПревышениеСуммДооценокНадСуммамиУценокБУ;
				
				// Хозрасчетный Дт 423 Кт 441
				ПроводкаБУ = ПроводкиБУ.Добавить();
				ПроводкаБУ.Период       = ДатаДока;
				ПроводкаБУ.Организация  = ТекОрганизация;
				
				ПроводкаБУ.СчетДт       = СтрокаТЧ.СчетУчетаДооценокОС;
				БухгалтерскийУчет.УстановитьСубконто(ПроводкаБУ.СчетДт, ПроводкаБУ.СубконтоДт, "ОсновныеСредства", ТекОС);
				
				ПроводкаБУ.СчетКт       = ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыль;
				
				ПроводкаБУ.Сумма        = СтрокаТЧ.ПревышениеСуммДооценокНадСуммамиУценокБУ;
				ПроводкаБУ.Содержание   = НСтр("ru='Списана сумма дооценок ОС';uk=''",Локализация.КодЯзыкаИнформационнойБазы());
				ПроводкаБУ.НомерЖурнала = "ОС";
				
			ИначеЕсли СтрокаТЧ.ПревышениеСуммДооценокНадСуммамиУценокБУ < 0 Тогда	
				
				// ПереоценкаОСБухгалтерскийУчет
				СтрокаДвижений = ПереоценкаОСБУ.ДобавитьПриход();
				
				СтрокаДвижений.Период           = ДатаДока;
				СтрокаДвижений.ОсновноеСредство = ТекОС;
				СтрокаДвижений.Организация      = ТекОрганизация;
				
				СтрокаДвижений.СуммаПереоценки 	= -СтрокаТЧ.ПревышениеСуммДооценокНадСуммамиУценокБУ;
				
			КонецЕсли;	
			
			// Движения по регистру НачислениеАмортизацииОСНалоговыйУчет
			Движение = НачислениеАмортизацииОСНУ.Добавить();
			Движение.Период               = ДатаДока;
			Движение.ОсновноеСредство     = ТекОС;
			Движение.Организация          = ТекОрганизация;
			Движение.НачислятьАмортизацию = Ложь;
			
			// Движения по регистру СобытияОС
			Движение = СобытиеОС.Добавить();
			Движение.Период               = ДатаДока;
			Движение.ОсновноеСредство     = ТекОС;
			Движение.Организация          = ТекОрганизация;
			Движение.Событие              = СтруктураШапкиДокумента.СобытиеРегл;
			Движение.НазваниеДокумента 	  = НазваниеДокумента;
			Движение.НомерДокумента		  = Номер;
	
			// Движения по регистру СостояниеОСОрганизаций
			Движение = СостояниеОС.Добавить();
			Движение.Период               = ДатаДока;
			Движение.ОсновноеСредство     = ТекОС;
			Движение.Организация          = ТекОрганизация;
			Движение.Состояние            = Перечисления.СостоянияОС.СнятоСУчета;
			Движение.ДатаСостояния        = ДатаДока;
			
			// Движения по регистру СтоимостьОС
			Движение = ТаблицаДвиженийАмортизация.Добавить();
			
			Движение.ОсновноеСредство = ТекОС;
			Движение.Организация      = ТекОрганизация;
			Движение.Амортизация      = СтрокаТЧ.АмортизацияБУ + СтрокаТЧ.АмортизацияЗаМесяцБУ;
			Движение.Стоимость        = СтрокаТЧ.СтоимостьБУ;
			Движение.АмортизацияНУ    = СтрокаТЧ.АмортизацияНУ + СтрокаТЧ.АмортизацияЗаМесяцНУ;
			Движение.СтоимостьНУ      = СтрокаТЧ.СтоимостьНУ;
			Движение.ВидОперации      = Перечисления.ВидыСобытийОС.Списание;
			
			//Заполнение переменных
			СчетУчетаСтоимости   = СтрокаТЧ.СчетУчетаБУ;
			СчетУчетаАмортизации = СтрокаТЧ.СчетНачисленияАмортизацииБУ;
			
			// списание амортизации Д СчетУчетаАмортизации К СчетУчетаСтоимости
			СуммаПроводки 	= СтрокаТЧ.АмортизацияБУ + СтрокаТЧ.АмортизацияЗаМесяцБУ;
			СуммаПроводкиНУ = СтрокаТЧ.АмортизацияНУ + СтрокаТЧ.АмортизацияЗаМесяцНУ;
			
			Если СуммаПроводки <> 0 ИЛИ (СуммаПроводкиНУ <> 0 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль) Тогда
				
				Проводка = ПроводкиБУ.Добавить();
				
				Проводка.Период      = ДатаДока;
				Проводка.Организация = ТекОрганизация;
				Проводка.Содержание  = "Списана амортизация";
				Проводка.Сумма       = СуммаПроводки;
				Проводка.НомерЖурнала = "ОС";
				
					Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение_ОС;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
					Проводка.СуммаНУДт = НалоговыйУчет.ОпределитьСтоимостьНУ(СтрокаТЧ.НалоговоеНазначение_ОС, СуммаПроводкиНУ);
					
				КонецЕсли;
				
				Проводка.СчетДт      = СчетУчетаАмортизации;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ТекОС);
				
					Проводка.НалоговоеНазначениеКт = СтрокаТЧ.НалоговоеНазначение_ОС;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
					Проводка.СуммаНУКт = НалоговыйУчет.ОпределитьСтоимостьНУ(СтрокаТЧ.НалоговоеНазначение_ОС, СуммаПроводкиНУ);
					
				КонецЕсли;
				
				Проводка.СчетКт      = СчетУчетаСтоимости;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", ТекОС);
				
			КонецЕсли;
			
			// списание остаточной стоимости Д СчетСписанияБУ К СчетУчетаСтоимости
			СуммаПроводки 	= СтрокаТЧ.СтоимостьБУ - СтрокаТЧ.АмортизацияБУ - СтрокаТЧ.АмортизацияЗаМесяцБУ;
			СуммаПроводкиНУ = СтрокаТЧ.СтоимостьНУ - СтрокаТЧ.АмортизацияНУ - СтрокаТЧ.АмортизацияЗаМесяцНУ;
			
			Если СуммаПроводки <> 0 ИЛИ (СуммаПроводкиНУ <> 0 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль) Тогда
				
				Проводка = ПроводкиБУ.Добавить();
				Проводка.Период      = ДатаДока;
				Проводка.Организация = ТекОрганизация;
				Проводка.Содержание  = "Списана ост. стоимость";
				Проводка.Сумма       = СуммаПроводки;
				Проводка.НомерЖурнала = "ОС";
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
					
					Проводка.НалоговоеНазначениеДт = НалоговоеНазначениеДоходовИЗатрат;
					
				КонецЕсли;	
				
				Проводка.СуммаНУДт = НалоговыйУчет.ОпределитьСтоимостьНУ(НалоговоеНазначениеДоходовИЗатрат, СуммаПроводкиНУ, СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015);
				ТекПараметрыОС = ТаблицаПараметрыОС.Найти(ТекОС,"ОС_БУ");
				ЛиквидационнаяСтоимость_БУ 	= ?(ТекПараметрыОС = Неопределено, 0, ТекПараметрыОС.ЛиквидационнаяСтоимость_БУ);
				Проводка.СуммаНУДт = Макс(Проводка.СуммаНУДт - ЛиквидационнаяСтоимость_БУ, 0);
				
				
				Проводка.СчетДт = СтруктураШапкиДокумента.СчетСписанияБУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтруктураШапкиДокумента.СубконтоБУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтруктураШапкиДокумента.СубконтоБУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтруктураШапкиДокумента.СубконтоБУ3);
				
					Проводка.НалоговоеНазначениеКт = СтрокаТЧ.НалоговоеНазначение_ОС;
				
				Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
					
					Проводка.СуммаНУКт = НалоговыйУчет.ОпределитьСтоимостьНУ(СтрокаТЧ.НалоговоеНазначение_ОС, СуммаПроводкиНУ);
					
				КонецЕсли;
				
				Проводка.СчетКт      = СчетУчетаСтоимости;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", ТекОС);
				
			КонецЕсли;
			
		КонецЦикла;

		АмортизацияОС.мПериод          = ДатаДока;
		АмортизацияОС.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
		Движения.СтоимостьОСБухгалтерскийУчет.ВыполнитьРасход();

	КонецЕсли;

	//При распределении амортизации производилась промежуточная запись проводок.
	//Необходимо записать проводки с сохранением предыдущих движений.
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И Не Отказ Тогда
		
		ПроводкиБУ.Записать(Ложь);
		
	КонецЕсли; 
		
КонецПроцедуры

Процедура ФормированиеДвиженияОСВременнаяНалоговаяРазница(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СписыватьОСВременнаяНалоговаяРазница Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;
    НомерЖурнала   = НСтр("ru='ОС';uk='ОЗ'",Локализация.КодЯзыкаИнформационнойБазы());
	
	НазваниеДокумента       = Метаданные().Представление();
	
	СостояниеОС             = Движения.СостоянияОСОрганизаций;
	СобытияОС               = Движения.СобытияОСОрганизаций;
	НачислениеАмортизацииБУ = Движения.НачислениеАмортизацииОСБухгалтерскийУчет;
	НачислениеАмортизацииНУ = Движения.НачислениеАмортизацииОСНалоговыйУчет;
	ПроводкиБУ              = Движения.Хозрасчетный;
	
	Счет1091 	= ПланыСчетов.Хозрасчетный.ДругиеОсновныеСредства; 
	Счет131 	= ПланыСчетов.Хозрасчетный.ИзносОсновныхСредств; 
	НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
	
	// Движения по регистру СостоянияОСОрганизаций
	Движение = СостояниеОС.Добавить();
	
	Движение.Период            = ДатаДока;
	Движение.ДатаСостояния     = ДатаДока;
	Движение.ОсновноеСредство  = ОсновноеСредствоВременнаяНалоговаяРазница;
	Движение.Организация       = ТекОрганизация;
	Движение.Состояние         = Перечисления.СостоянияОС.СнятоСУчета;
	
	// Движения по регистру СобытияОСОрганизаций
	Движение = СобытияОС.Добавить();
	
	Движение.Период            = ДатаДока;
	Движение.ОсновноеСредство  = ОсновноеСредствоВременнаяНалоговаяРазница;
	Движение.Организация       = СтруктураШапкиДокумента.Организация;
	Движение.Событие           = СтруктураШапкиДокумента.СобытиеРегл;
	Движение.НазваниеДокумента = НазваниеДокумента;
	Движение.НомерДокумента    = Номер;
	
	// Движения по регистру НачислениеАмортизацииОСНалоговыйУчет
	Движение = НачислениеАмортизацииНУ.Добавить();
	
	Движение.Период               = ДатаДока;
	Движение.ОсновноеСредство     = ОсновноеСредствоВременнаяНалоговаяРазница;
	Движение.Организация          = ТекОрганизация;
	Движение.НачислятьАмортизацию = Ложь;
	
	// списание амортизации Д СчетНачисленияАмортизацииБУ К СчетУчетаОС
	Если АмортизацияНУВременнаяНалоговаяРазница <> 0 Тогда
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = ДатаДока;
		Проводка.Активность   = Истина;
		Проводка.Организация  = ТекОрганизация;
		Проводка.Содержание   = НСтр("ru='Списана амортизация';uk='Списано амортизацію'",Локализация.КодЯзыкаИнформационнойБазы());
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Сумма        = 0;
		
		Проводка.НалоговоеНазначениеДт = НеОблНДСДеятельность;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Проводка.СуммаНУДт = АмортизацияНУВременнаяНалоговаяРазница;
			
		КонецЕсли;
		
		Проводка.СчетДт = Счет131;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ОсновноеСредствоВременнаяНалоговаяРазница);
		
		Проводка.СчетКт = Счет1091;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", ОсновноеСредствоВременнаяНалоговаяРазница);
		
		Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Проводка.СуммаНУКт = АмортизацияНУВременнаяНалоговаяРазница;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// списание остаточной стоимости Д 00 К СчетУчетаОС
	Если ОстаточнаяСтоимостьНУВременнаяНалоговаяРазница <> 0 Тогда
		
		Проводка = ПроводкиБУ.Добавить();
		
		Проводка.Период       = ДатаДока;
		Проводка.Организация  = ТекОрганизация;
		Проводка.Содержание   = НСтр("ru='Списана ост. стоимость';uk='Списана зал. вартість'",Локализация.КодЯзыкаИнформационнойБазы());
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Сумма        = 0;
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
		
		Проводка.СчетКт = Счет1091;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", ОсновноеСредствоВременнаяНалоговаяРазница);
		
		Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Проводка.СуммаНУКт = ОстаточнаяСтоимостьНУВременнаяНалоговаяРазница;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// Стоимость ОС
	СтоимостьОСБУ = Движения.СтоимостьОСБухгалтерскийУчет;
	
	СтрокаДвижений = СтоимостьОСБУ.ДобавитьРасход();
	
	СтрокаДвижений.Период           = ДатаДока;
	СтрокаДвижений.ОсновноеСредство = ОсновноеСредствоВременнаяНалоговаяРазница;
	СтрокаДвижений.Организация      = ТекОрганизация;
	
	СтрокаДвижений.СтоимостьНУ 		= ОстаточнаяСтоимостьНУВременнаяНалоговаяРазница + АмортизацияНУВременнаяНалоговаяРазница;
	СтрокаДвижений.АмортизацияНУ 	= АмортизацияНУВременнаяНалоговаяРазница;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРКИ ПРАВИЛЬНОСТИ ЗАПОЛНЕНИЯ

// Формирует структуру полей, обязательных для заполнения при отражении фактического
// движения средств по банку.
//
// Возвращаемое значение:
//   СтруктураОбязательныхПолей   – структура для проверки
//
Функция СтруктураОбязательныхПолейШапки(СтруктураШапкиДокумента)

	СтруктураПолей = Новый Структура;
	
	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейОплата()

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("ОсновноеСредство");
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей, Отказ, Заголовок);	

	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		// Проверим возможность снятия ОС с учета
		Для каждого СтрокаОС из ОС Цикл
			Если ОтражатьВБухгалтерскомУчете тогда
				УправлениеВнеоборотнымиАктивами.ПроверитьВозможностьСнятияСУчета(СтрокаОС.ОсновноеСредство,Дата,Отказ,Организация);
			КонецЕсли;
			Если ОтражатьВУправленческомУчете тогда
				УправлениеВнеоборотнымиАктивами.ПроверитьВозможностьСнятияСУчета(СтрокаОС.ОсновноеСредство,Дата,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПроверкаРеквизитов()

// Проверяет заполнение табличной части документа
// для управленческого учета
Процедура ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)
	
	//Проверка на наличие основных средств
	Для каждого СтрокаТЧ Из ОС Цикл
		
		ТекОС = СтрокаТЧ.ОсновноеСредство;
		
		Если СтрокаТЧ.Стоимость = 0 Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
			                    + "Упр. учет: Основное средство """ + ТекОс + """ не заполнена Стоимость(УУ)",
			                    Отказ, Заголовок);
			
		КонецЕсли;
		
		СтрокаОстатков = ТаблицаОстатков.Найти(ТекОС, "ОС_УУ");
		
		Если СтрокаОстатков <> Неопределено Тогда
			
			Продолжить
			
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьОбОшибке("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
		                    + "Упр.учет: По основному средству """ + ТекОс + """ нет записей до даты документа"
		                    + Символы.ПС + Символы.Таб + "в регистре сведений ""Местонахождение основных средств организаций""."
		                    + Символы.ПС + Символы.Таб + "Возможно оно еще не принято к управленческому учету.",
		                    Отказ, Заголовок);
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверяет заполнение табличной части документа
// для бухгалтерского и налогового учета
Процедура ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)
	
	ТекОрганизация = СтруктураШапкиДокумента.Организация;
	
	//Проверка на наличие основных средств
		Для каждого СтрокаТЧ Из ОС Цикл
			
			ТекОС = СтрокаТЧ.ОсновноеСредство;
			
			Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И (СтрокаТЧ.СтоимостьБУ = 0) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
									+ "Бухг. учет: Основное средство """ + ТекОс + """ не заполнена Стоимость(БУ)",
									Отказ, Заголовок);
				
			КонецЕсли;
			
			СтрокаОстатков = ТаблицаОстатков.Найти(ТекОС, "ОС_БУ");
			
			Если СтрокаОстатков <> Неопределено Тогда
				
				Продолжить
				
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьОбОшибке("Строка " + СтрокаТЧ.НомерСтроки + "." + Символы.ПС + Символы.Таб
								+ "Бух.учет: Организация """ + ТекОрганизация + """. По основному средству """ + ТекОс + """ нет записей до даты документа"
								+ Символы.ПС + Символы.Таб + "в регистре сведений ""Местонахождение основных средств организаций""."
								+ Символы.ПС + Символы.Таб + "Возможно оно еще не принято к бухгалтерскому учету.",
								Отказ, Заголовок);
			
		КонецЦикла;
		
КонецПроцедуры // ПроверитьЗаполнениеТЧ


// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолейШапки(СтруктураШапкиДокумента), Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
// для управленческого учета
Процедура ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)

	Если (НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	
	СтруктураПолей.Вставить("Событие");

	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураПолей, Отказ, Заголовок);
	
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.Событие.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(СтруктураШапкиДокумента.Событие.ВидСобытияОС,
							  Перечисления.ВидыСобытийОС.Списание,
							  ПредставлениеРеквизита,Отказ);
	
	ПроверитьЗаполнениеТЧУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок);
	
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
// для бухгалтерского и налогового учета
Процедура ПроверитьЗаполнениеДокументаРегл( СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок)

	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;

	СтруктураПолей.Вставить("Организация");
	СтруктураПолей.Вставить("СобытиеРегл");
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете И ОС.Количество() > 0 Тогда
		
		СтруктураПолей.Вставить("СчетСписанияБУ");
		
		Для Н = 1 По СчетСписанияБУ.ВидыСубконто.Количество() Цикл
			
			СтруктураПолей.Вставить("СубконтоБУ" + Н);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураПолей, Отказ, Заголовок);
	
	Если ОС.Количество() > 0 Тогда
		НалоговыйУчет.ПроверитьЗаполнениеНалоговыхНазначений(
			СтруктураШапкиДокумента, 
			Неопределено,      // Неопределено - в случае проверки шапки документа
			Неопределено,      // Неопределено - в случае проверки шапки документа
			Отказ, 
			Заголовок, 
			"ОтражениеЗатрат", // ВидОперации
			Истина,            // ОтражатьПоЗатратам,
			"СчетСписанияБУ",  // ИмяРеквизитаСчетЗатрат
			"СубконтоБУ"       // ИмяРеквизитаСубконтоЗатрат
		);
	КонецЕсли;
	
	ПредставлениеРеквизита = ЭтотОбъект.Метаданные().Реквизиты.СобытиеРегл.Представление();
	УправлениеВнеоборотнымиАктивами.ПроверкаЗаполненияСобытий(СтруктураШапкиДокумента.СобытиеРегл.ВидСобытияОС,
								  Перечисления.ВидыСобытийОС.Списание,
								  ПредставлениеРеквизита,Отказ);
	
	ПроверитьЗаполнениеТЧРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОсновныеСредства") Тогда

		СтрокаТабличнойЧасти = ОС.Добавить();

		СтрокаТабличнойЧасти.ОсновноеСредство = Основание.Ссылка;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		
		// Заполнение шапки
		Организация                  = Основание.Организация;
		ОтражатьВБухгалтерскомУчете  = Основание.ОтражатьВБухгалтерскомУчете;
		ОтражатьВУправленческомУчете = Основание.ОтражатьВУправленческомУчете;
		
		Для Каждого ТекСтрокаОС Из Основание.ОС Цикл
			
			РасхождениеУУ = ТекСтрокаОС.КоличествоУУ - ТекСтрокаОС.КоличествоПоФактуУУ;
			РасхождениеБУ = ТекСтрокаОС.КоличествоБУ - ТекСтрокаОС.КоличествоПоФактуБУ;
			
			Если (РасхождениеУУ <=  0) И (РасхождениеБУ <= 0) Тогда
				
				Продолжить
				
			КонецЕсли;
			
			НоваяСтрока = ОС.Добавить();
			НоваяСтрока.ОсновноеСредство               = ТекСтрокаОС.ОсновноеСредство;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ,РежимПроведения)

	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШапкиДокумента.Вставить("ПериодРегистрации", КонецМесяца(Дата));
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	Если Отказ Тогда
		
		Возврат
		
	КонецЕсли;
	
	ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	ПроверкаРеквизитовТЧ(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ОсновноеСредство", "ОсновноеСредство");
	
	Если СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		
		СтруктураПолей.Вставить("Стоимость",          "Стоимость");
		СтруктураПолей.Вставить("Амортизация",        "Амортизация");
		СтруктураПолей.Вставить("АмортизацияЗаМесяц", "АмортизацияЗаМесяц");
		
	КонецЕсли;

	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		
		СтруктураПолей.Вставить("СтоимостьБУ",          "СтоимостьБУ");
		СтруктураПолей.Вставить("АмортизацияБУ",        "АмортизацияБУ");
		СтруктураПолей.Вставить("АмортизацияЗаМесяцБУ", "АмортизацияЗаМесяцБУ");
		
		СтруктураПолей.Вставить("СтоимостьНУ",          "СтоимостьНУ");
		СтруктураПолей.Вставить("АмортизацияНУ",        "АмортизацияНУ");
		СтруктураПолей.Вставить("АмортизацияЗаМесяцНУ", "АмортизацияЗаМесяцНУ");

		СтруктураПолей.Вставить("ПревышениеСуммДооценокНадСуммамиУценокБУ",       "ПревышениеСуммДооценокНадСуммамиУценокБУ");

	КонецЕсли;

	РезультатЗапросаПоОС = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ОС", СтруктураПолей);
	ТаблицаПоОС          = РезультатЗапросаПоОС.Выгрузить();
																		   
	СписокОС             = ТаблицаПоОС.ВыгрузитьКолонку("ОсновноеСредство");
	ТекОрганизация       = СтруктураШапкиДокумента.Организация;
	Упр                  = СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
	Бухг                 = СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете;
	
	//Проверка на наличие основных средств
	Запрос       = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата",        МоментВремени());
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	Запрос.УстановитьПараметр("ТекОрганизация", ТекОрганизация);
	Запрос.Текст = "ВЫБРАТЬ" + ?(Упр,"
	               |	МестонахождениеОС_УУ.ОсновноеСредство КАК ОС_УУ", "") + ?(Бухг, ?(Упр, ",", "") + "
	               |	МестонахождениеОС_БУ.ОсновноеСредство КАК ОС_БУ", "") + "
	               |ИЗ" + ?(Упр,"
	               |	РегистрСведений.МестонахождениеОС.СрезПоследних(&ТекДата, 
				   |	                ОсновноеСредство В (&СписокОС)
				   |	                ) КАК МестонахождениеОС_УУ", "") + ?(Упр и Бухг,"
	               |		ПОЛНОЕ СОЕДИНЕНИЕ", "") + ?(Бухг,"
				   |			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
				   |	                        &ТекДата, ОсновноеСредство В (&СписокОС)
				   |	                        И Организация = &ТекОрганизация
				   |	                        ) КАК МестонахождениеОС_БУ", "") + ?(Упр и Бухг,"
	               |		ПО МестонахождениеОС_УУ.ОсновноеСредство = МестонахождениеОС_БУ.ОсновноеСредство", "");
		

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	ПроверитьЗаполнениеДокументаУпр(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок);
	ПроверитьЗаполнениеДокументаРегл(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаОстатков, Отказ, Заголовок);

	УправлениеВнеоборотнымиАктивами.ПроверитьДубли(ТаблицаПоОС, "Основные средства", "ОсновноеСредство", "Основное средство", Отказ, Заголовок);	
		
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;

	Запрос   = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекОрганизация", СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ТекПериод",      МоментВремени());
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаПоОС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
   	|	ВнешнийИсточник.ОсновноеСредство
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник
	|;
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство                                                                         	КАК ОсновноеСредство,
	|	СпособыОтраженияРасходовПоАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство                      	КАК ОС_БУ,
	|	СпособыОтраженияРасходовПоАмортизацииСрезПоследних.ОсновноеСредство                                       	КАК ОС_УУ,
	|	СпособыОтраженияРасходовПоАмортизацииБухгалтерскийУчетСрезПоследних.СпособыОтраженияРасходовПоАмортизации 	КАК Направление_БУ,
	|	СпособыОтраженияРасходовПоАмортизацииСрезПоследних.СпособыОтраженияРасходовПоАмортизации                  	КАК Направление_УУ,
	|	МестонахождениеОСУУ.Местонахождение 																		КАК Местонахождение_УУ,
	|	МестонахождениеОСБУ.Местонахождение                  														КАК Местонахождение_БУ,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ЛиквидационнаяСтоимость 								КАК ЛиквидационнаяСтоимость_БУ
	|ИЗ
	|	ОсновныеСредства
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства) И Организация = &ТекОрганизация) КАК СпособыОтраженияРасходовПоАмортизацииБухгалтерскийУчетСрезПоследних
	|	ПО ОсновныеСредства.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства)) КАК СпособыОтраженияРасходовПоАмортизацииСрезПоследних
	|	ПО ОсновныеСредства.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииСрезПоследних.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства)) КАК МестонахождениеОСУУ
	|	ПО ОсновныеСредства.ОсновноеСредство = МестонахождениеОСУУ.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства) И Организация = &ТекОрганизация) КАК МестонахождениеОСБУ
	|	ПО ОсновныеСредства.ОсновноеСредство = МестонахождениеОСБУ.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ТекПериод, ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ ОсновныеСредства) И Организация = &ТекОрганизация) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|	ПО ОсновныеСредства.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство";
	ТаблицаПараметрыОС = Запрос.Выполнить().Выгрузить();
	
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоОС, ТаблицаПараметрыОС, Отказ, Заголовок);
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "При копировании" 
//
Процедура ПриКопировании(ОбъектКопирования)
	
	мСкопирован = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		НалоговыйУчет.ЗаполнитьНалоговыеНазначенияВШапкеПередЗаписьюДокумента(
			ЭтотОбъект,
			"СчетСписанияБУ",   // ИмяРеквизитаСчетЗатрат
			"СубконтоБУ" 		// ИмяРеквизитаСубконто
		);
		
	КонецЕсли;
             	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

мСкопирован = Ложь;
